Update LTI-jaa.md
use cases w/plantUML
